# Стадия сборки: AS builder даёт имя стадии сборки
# берём готовый образ, где уже есть Linux + Gradle + JDK 21
FROM gradle:8.10.2-jdk21 AS builder

# создаём/выбираем рабочую папку внутри контейнера
# все следующие команды выполняются оттуда
WORKDIR /workspace

# копируем весь проект в контейнер
COPY . .

# внутри контейнера собираем твой war
RUN gradle clean war --no-daemon

# вторая стадия сборки:
# берём уже другой образ: Linux + Tomcat 10.1 + JDK 21
# здесь приложение уже не собирается, а запускается!
FROM tomcat:10.1-jdk21-temurin

# удаляем стандартные приложения Tomcat чтобы остался только твой war
RUN rm -rf /usr/local/tomcat/webapps/*

# копируем собранный war из стадии builder
# кладём его в папку Tomcat, откуда он автоматически деплоится
COPY --from=builder /workspace/build/libs/*.war /usr/local/tomcat/webapps/mytodoapp.war

# это декларация: контейнер использует порт 8080
# сама по себе порт наружу не открывает!
# реальное пробрасывание наружу делается в docker-compose.yml через ports
EXPOSE 8080

# CMD ["catalina.sh", "run"] - эту команду можно не указывать!!!
# В образе tomcat:10.1-jdk21-temurin уже прописана эта команда по умолчанию!
# команду CMD (или ENTRYPOINT) обычно указывают в самом конце Dockerfile.
#Это логично, потому что она задаёт, что должно выполняться при запуске контейнера,
# после всех подготовительных действий (копирования файлов, установки зависимостей и т.д.)

# Комментарии:
# Dockerfile - это инструкция как собрать образ моего приложения
# Но для связи с mysql нужно запускать отдельный контейнер через docker-compose.yml
# минимальная ОС тут задаётся неявно, внутри базовых образов gradle: и tomcat:
# путь /usr/local/tomcat/webapps важен только внутри контейнера, не на твоём компьютере
# EXPOSE 8080 полезен как документация и соглашение, но для compose не строго обязателен
# Почему команды именно в такой последовательности:
# 1. сначала нужен образ для сборки
# 2. потом нужно собрать war
# 3. потом нужен отдельный более лёгкий runtime-образ
# 4. потом туда копируется результат сборки
# 5. в конце указываем порт
  # Это называется multi-stage build:
  # первая стадия собирает
  # вторая только запускает
  # итоговый образ чище и меньше